---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsPathType.ShowArrowheadToCutMark
source: html/fb981813-456a-c975-1610-aafc2a0fd1dd.htm
---
# Autodesk.Revit.DB.Architecture.StairsPathType.ShowArrowheadToCutMark Property

True if the stairs path arrowhead should be shown to the cutmark, false if the arrow head is not shown.

## Syntax (C#)
```csharp
public bool ShowArrowheadToCutMark { get; set; }
```